
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

void screen_03(int input, char *mas[8], int *next)
{ 
	char *a, *b;

	if( *next == 1 )
	{
		a = mas[0];
		b = mas[1];
	}
	else
	{
		if( *next == 2 )
		{
			a = mas[2];
			b = mas[3];
		}
		else
		{
			if( *next == 3 )
			{
				a = mas[4];
				b = mas[5];
			}
			else
			{
				a = mas[6];
				b = mas[7];
			}
		}
	}
	printf("\n");
	printf(" *************************************    *************************************\n");
	printf(" *              GROUP %s              *    *              GROUP %s              *\n", a, b);
	printf(" *                                   *    *                                   *\n");
	printf(" *************************************    *************************************\n");
	printf(" *                                   *    *                                   *\n");
	printf(" *************************************    *************************************\n");
	printf(" *                                   *    *                                   *\n");
	printf(" *************************************    *************************************\n");
	printf(" *                                   *    *                                   *\n");
	printf(" *************************************    *************************************\n");
	printf(" *                                   *    *                                   *\n");
	printf(" *************************************    *************************************\n");
	printf("\n (Совет: Для просмотра других пар групп, нажмите 1,2,3 или 4)\n (Хотите продолжить генерацию? Нажмите '5' | Выйти в меню - нажмите '0')\n: ");
	scanf("%d", &*next);
	system("clear");
}

void screen_02(int input)
{
	int next = 1;
	char* mas[] = {"A", "B", "C", "D", "E", "F", "G", "H"};
	while( next != 0 )
	{
		printf("\n");
		printf(" ******************************************************************************\n");
		printf(" *                                                                            *\n");
		printf(" *              Список отборочных групп на основе подбора команд              *\n");
		printf(" *                                                                            *\n");
		printf(" ******************************************************************************\n");
		screen_03(input, mas, &next);
	}
}

void screen_01(int input)
{
	int mode;
	
	system("clear");

	printf("\n");
	printf(" ****************************************************************************** \n");
	printf("  *                                                                          *  \n");
	printf("   *                GENERATOR OF A TOURNAMENT GRID (v.1.1) 2017             *   \n");
	printf("  *                                                                          *  \n");
	printf(" ****************************************************************************** \n");
	printf(" *                                                                            * \n");
	printf(" *                             Добро пожаловать!                              * \n");
	printf(" *                                                                            * \n");
	printf("  *        Выберите один из пунктов меню для того, чтобы начать работу:      *  \n");
	printf("   *                                                                        *   \n");
	printf("   **************************************************************************   \n");
	printf("   *                                                                        *   \n");
	printf("   *       > НАЧАТЬ ОТБОРОЧНЫЙ ТУРНИР                     (нажмите '1')     *   \n");
	printf("   *                                                                        *   \n");
	printf("   **************************************************************************   \n");
	printf("   *                                                                        *   \n");
	printf("   *       > ПОМОЩЬ И СПРАВОЧНЫЕ МАТЕРИАЛЫ                (нажмите '2')     *   \n");
	printf("   *                                                                        *   \n");
	printf("   **************************************************************************   \n");
	printf("   *                                                                        *   \n");
	printf("   *       > ВЫЙТИ ИЗ ПРОГРАММЫ                           (нажмите '3')     *   \n");
	printf("   *                                                                        *   \n");
	printf("   **************************************************************************   \n : ");

	scanf("%d", &mode);

	system("clear");

	if( mode == 2 || mode == 3)
	{
		exit(1);
	}
}

int main()
{
	int input = 1;
	screen_01(input);
	screen_02(input);
	return 0;
}
