#include <stdio.h>
#include <stdlib.h>
#include "graphics.h"

void screen_01(int input)
{
        int mode;

        system("clear");

        printf("\n");
        printf(" ****************************************************************************** \n");
        printf("  *                                                                          *  \n");
        printf("   *                GENERATOR OF A TOURNAMENT GRID (v.1.1) 2017             *   \n");
        printf("  *                                                                          *  \n");
        printf(" ****************************************************************************** \n");
        printf(" *                                                                            * \n");
        printf(" *                             Добро пожаловать!                              * \n");
        printf(" *                                                                            * \n");
        printf("  *        Выберите один из пунктов меню для того, чтобы начать работу:      *  \n");
        printf("   *                                                                        *   \n");
        printf("   **************************************************************************   \n");
        printf("   *                                                                        *   \n");
        printf("   *       > НАЧАТЬ ОТБОРОЧНЫЙ ТУРНИР          [Для выбора нажмите '1']     *   \n");
        printf("   *                                                                        *   \n");
        printf("   **************************************************************************   \n");
        printf("   *                                                                        *   \n");
        printf("   *       > ПОМОЩЬ И СПРАВОЧНЫЕ МАТЕРИАЛЫ     [Для выбора нажмите '2']     *   \n");
        printf("   *                                                                        *   \n");
        printf("   **************************************************************************   \n");
        printf("   *                                                                        *   \n");
        printf("   *       > ВЫЙТИ ИЗ ПРОГРАММЫ                [Для выбора нажмите '3']     *   \n");
        printf("   *                                                                        *   \n");
        printf("   **************************************************************************   \n : ");

        scanf("%d", &mode);

        system("clear");

        if( mode != 1 )
        {
                exit(1);
        }
}

