#include <stdio.h>
#include <stdlib.h>

void screen_04_1(int mode, char **word)
{
	printf("  *********************************************************                     \n");
        printf("  *  GROUP 'A'  *  GROUP 'B'  *  GROUP 'C'  *  GROUP 'D'  *                     \n");
        if(mode == 1 || mode == 999)
        {
        printf("  *             *******************************************                     \n");
        printf("  ***************                                                               \n");
        }
        else if(mode == 2)
        {
        printf("  ***************             *****************************                     \n");
        printf("                ***************                                                 \n");
        }
	else if(mode == 3)
        {
        printf("  *****************************             ***************                     \n");
        printf("                              ***************                                   \n");
        }
        else if(mode == 4)
        {
        printf("  *******************************************             *                     \n");
        printf("                                            ***************                     \n");
        }
	printf("                                                                                \n");
} 

void screen_04(int *mas, int mode, char **word)
{
	int i = 0, num = 1;
	char *a = "ВЫИГР.", *b = "ПОР-ИЙ", *c = "НИЧЬИХ", *d = "ЗМ||ПМ", *e = "И.ОЧКИ", *w;
        system("clear");
	for(i = 1; i <=5; i++)
                num = num + mas[i];
	screen_04_1(mode,word);
        if(num == 2)
        {
       	printf("                                                                               \n");
        printf("  ***********************************                                          \n");
        printf("  *                        *        *                                          \n");
		array_check(mas,word,a,b,c,d,e);
	printf("  *    НАЗВАНИЕ СБОРНОЙ    * %s *                                         \n", word[0]);
	printf("  *                        *        *                                          \n");
        printf("  ***********************************                                          \n");
        printf("  *                        *        *                                          \n");
        printf("  ***********************************                                          \n");
        printf("  *                        *        *                                          \n");
        printf("  ***********************************                                          \n");
        printf("  *                        *        *                                          \n");
        printf("  ***********************************                                          \n");
        printf("  *                        *        *                                          \n");
        printf("  ***********************************                                          \n");
	}
	else if(num == 3)
	{
	printf("  ********************************************                                 \n");
	printf("  *                        *        *        *                                 \n");
		array_check(mas,word,a,b,c,d,e);
        printf("  *    НАЗВАНИЕ СБОРНОЙ    * %s * %s *                                 \n", word[0], word[1]);
        printf("  *                        *        *        *                                 \n");
        printf("  ********************************************                                 \n");
        printf("  *                        *        *        *                                 \n");
        printf("  ********************************************                                 \n");
        printf("  *                        *        *        *                                 \n");
        printf("  ********************************************                                 \n");
        printf("  *                        *        *        *                                 \n");
        printf("  ********************************************                                 \n");
        printf("  *                        *        *        *                                 \n");
        printf("  ********************************************                                 \n");
	}
	else if(num == 4)
	{
	printf("  *****************************************************                        \n");
	printf("  *                        *        *        *        *                        \n");
		array_check(mas,word,a,b,c,d,e);
        printf("  *    НАЗВАНИЕ СБОРНОЙ    * %s * %s * %s *                        \n", word[0], word[1], word[2]);
        printf("  *                        *        *        *        *                        \n");
        printf("  *****************************************************                        \n");
        printf("  *                        *        *        *        *                        \n");
        printf("  *****************************************************                        \n");
        printf("  *                        *        *        *        *                        \n");
        printf("  *****************************************************                        \n");
        printf("  *                        *        *        *        *                        \n");
        printf("  *****************************************************                        \n");
        printf("  *                        *        *        *        *                        \n");
        printf("  *****************************************************                        \n");
	}
	else if(num == 5)
	{
	printf("  **************************************************************               \n");
	printf("  *                        *        *        *        *        *               \n");
		array_check(mas,word,a,b,c,d,e);
	printf("  *    НАЗВАНИЕ СБОРНОЙ    * %s * %s * %s * %s *               \n", word[0], word[1], word[2], word[3]);
        printf("  *                        *        *        *        *        *               \n");
        printf("  **************************************************************               \n");
        printf("  *                        *        *        *        *        *               \n");
        printf("  **************************************************************               \n");
        printf("  *                        *        *        *        *        *               \n");
        printf("  **************************************************************               \n");
        printf("  *                        *        *        *        *        *               \n");
        printf("  **************************************************************               \n");
        printf("  *                        *        *        *        *        *               \n");
        printf("  **************************************************************               \n");
	}
	else if(num == 6 || num == 1)
	{
        printf("  ***********************************************************************      \n");
        printf("  *                        *        *        *        *        *        *      \n");
        printf("  *    НАЗВАНИЕ СБОРНОЙ    * %s * %s * %s * %s * %s *      \n", a,b,c,d,e);
        printf("  *                        *        *        *        *        *        *      \n");
        printf("  ***********************************************************************      \n");
        printf("  *                        *        *        *        *        *        *      \n");
        printf("  ***********************************************************************      \n");
        printf("  *                        *        *        *        *        *        *      \n");
        printf("  ***********************************************************************      \n");
        printf("  *                        *        *        *        *        *        *      \n");
        printf("  ***********************************************************************      \n");
        printf("  *                        *        *        *        *        *        *      \n");
        printf("  ***********************************************************************      \n");
        }
	printf("\n  (Подсказка: Для просмотра других групп, нажмите 1,2,3 или 4.)                 \n");
	printf("  Для создания таблицы - нажмите 5. Хотите продолжить? Нажмите 0!         \n");
	printf("                                                                                \n");
	printf("  [Выберите интересующий вас пункт]: ");
        scanf("%d", &mode);
	if(mode == 1 || mode == 2 || mode == 3 || mode == 4)
	{
		screen_04(mas,mode,word);
	}
	int j = 1;
	if(mode == 5)
	{
		for(i = 0; i < 100; i++)
                	mas[i] = 0;
		screen_05(j,mas,word);
	}
}

void screen_05(int j, int *mas, char **word)
{
	int i, m;
	system("clear");
        printf(" ****************************************************************************** \n");
        printf("  *                                                                          *  \n");
        printf("   *          GENERATOR OF A GRID FOR TOURNAMENT DATA  (v.1.0) 2017         *   \n");
        printf("  *                                                                          *  \n");
        printf(" ****************************************************************************** \n");
        printf(" *                                                                            * \n");
        printf(" *      Пожалуйста, выберите необходимые данные для вас из списка ниже,       * \n");
        printf(" *                                                                            * \n");
        printf("  *  после чего введите их идентификаторы без пробелов, подтвердив 'Enter'.  *  \n");
        printf("   *                                                                        *   \n");
        printf("   *     1 - Количество выйгранных игр сборной                              *   \n");
        printf("   *     2 - Количество проигранных игр сборной                             *   \n");
        printf("   *     3 - Количество игр сборной, сыгранных вничью                       *   \n");
        printf("   *     4 - Разница забитых/пропущенных мячей сборной                      *   \n");
        printf("   *     5 - Количество очков сборной в турнире на данных момент            *   \n");
        printf("   *                                                                        *   \n");
        printf("   *                                                                        *   \n");
        printf("   *                                                                        *   \n");
        printf("   *                                                                        *   \n");
        if(j <= 0 || j>= 6)
	{
	printf("   *     Возможно, произведён неправильный ввод! Пожалуйста,                *   \n");
        printf("   *     введите идентификаторы из списка без пробелов и повторов.          *   \n");
        }
	else
	{
	printf("   *                                                                        *   \n");
        printf("   *                                                                        *   \n");
	}
	printf("   *                                                                        *   \n");
        printf("   **************************************************************************   \n [Введите идентификаторы(Без пробелов)]: ");
	scanf("%d", &j);
	if(j>55555)
		screen_05(j,mas,word);
	for(i = 0; i < 5; i++)
	{
		m = j % 10;
		j = j / 10;
                        if(m == 1 && mas[m] != 1)
                        {
			        mas[m] = 1;
			}
                        else if(m == 2 && mas[m] != 1)
                        {
				mas[m] = 1;
			}
                        else if(m == 3 && mas[m] != 1)
			{
                                mas[m] = 1;
			}
                        else if(m == 4 && mas[m] != 1)
                                mas[m] = 1;
                        else if(m == 5 && mas[m] != 1)
                                mas[m] = 1;
	}
	int mode = 999;
	screen_04(mas,mode,word);
}

void array_check(int *mas, char **words, char *a, char *b, char *c, char *d, char *e)
{
	int i = 0, j = 0, p, t;
		for(j = 1; j <= 5; j++)
		{
			if(mas[j] == 1)
			{
				p = j;
				if(p == 1 && mas[p + 10] == 0)
				{
					words[i] = a;
					mas[p + 10] = 1;
					i++;
				}
				else if(p == 2 && mas[p + 10] == 0)
				{
					words[i] = b;
					mas[p + 10] = 1;
					i++;
				}
				else if(p == 3 && mas[p + 10] == 0)
				{
					words[i] = c;
					mas[p + 10] = 1;
					i++;
				}
				else if(p == 4 && mas[p + 10] == 0)
				{
					words[i] = d;
					mas[p + 10] = 1;
					i++;
				}
				else if(p == 5 && mas[p + 10] == 0)
				{
					words[i] = e;
					mas[p + 10] = 1;
					i++;
				}
		}
	}
}

int main()
{
	
	int mas[100], i = 0, mode = 999;
	char **word;
        word = (char**)calloc(51208,sizeof(char*));
        for(i=0;i<51208;i++)
        {
                word[i] = (char*)calloc(60,sizeof(char));
        }
	for(i = 0; i < 100; i++)
		mas[i] = 0;
	screen_04(mas,mode,word);
	return 0;
}

